public/math/eigenvalues-and-eigenvectors.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">

</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../subjects.html">Subjects</a> &gt; <a href="mathematics.html">Mathematics</a> &gt; <a href="notes.html">Notes</a> &gt;
</p>
<div id="outline-container-org23b45fa" class="outline-2">
<h2 id="org23b45fa">Eigenvalues and Eigenvectors</h2>
<div class="outline-text-2" id="text-org23b45fa">
<p>
Today we will look at Eigenvalues and Eigenvectors in linear
algebra. I will use the great book "Algebra Lineare" by Marco Abate as
my reference.
</p>

<p>
Eigenvectors are an important theoretical and practical topic, they
are is used in <a href="../programming/notes/ml/09-unsupervised-learning.html">machine learning</a> and are often used as the preferred
axis for rotations or other transformations.
</p>
</div>
<div id="outline-container-org44b07b9" class="outline-3">
<h3 id="org44b07b9">Definition</h3>
<div class="outline-text-3" id="text-org44b07b9">
<p>
Let \(T: V\rightarrow V\) be an endomorphism (maps from a space to
itself) of a vector space \(V\). A vector \(v_0 \ne 0\) of \(V\) is an
eigenvector of \(T\) with respect to the <b>eigenvalue</b> \(\lambda\) if:
</p>

<p>
\[T(v_0)=\lambda v_0\]
</p>

<p>
The set of <b>eigenvalues</b> is called the spectre of \(T\). If \(\lambda \in
\ space(T)\) then the set:
</p>

<p>
\[V_{\lambda} = \{ v\in T\ |\ T(v)=\lambda v \}\]
</p>

<p>
is called <b>eigenspace</b>.
</p>

<p>
Notice that from the definition follows:
</p>

<p>
\[Tv_0 - \lambda v_0 = 0\]
\[(T - \lambda I)v_0 = 0\]
</p>

<p>
Therefore \((T-\lambda I)=0\) (is singular) and it's determinant
is 0.
</p>

<p>
\[det(T-\lambda I)=0\]
</p>

<p>
This is very useful to compute the eigenvalues. Once you have those,
and T, you can use them in the definition to get the eigenspace and
the eigenvectors.
</p>

<hr />

<p>
Travel: <a href="notes.html">Mathematics Notes</a>, <a href="../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
